package ru.job4j.exercises.array.symmetric.diff;


/**
 * 49. Симметрическая разность множеств
 * Симметрическая разность - это такая операция, когда в результирующее
 * множество попадают все элементы из обоих множеств, кроме тех, которые есть и в том и в другом множествах.
 * <p>
 * Ваша задача реализовать эту операцию. Множества заданы в виде массивов.
 * <p>
 * Например,
 * <p>
 * {1}, {2} => {1, 2}
 * <p>
 * {1, 2}, {2, 3} => {1, 3}
 * <p>
 * {1}, {} => {1}
 */
public class SymmetricDiff {
    public static int[] diff(int[] left, int[] right) {

    }
}
